GD32-MCU-IOT/hal_gigadevice_zephyr/include/dt-bindings/pinctrl/gd32e517r(c-e)xx-pinctrl.h
/* CMP3_IM5 */
#define CMP3_IM5_PA5 \
	GD32_PINMUX_AFIO('A', 5, GPIO_IN, NORMP)

/* CMP3_IM7 */
#define CMP3_IM7_PB2 \
	GD32_PINMUX_AFIO('B', 2, GPIO_IN, NORMP)

/* CMP3_IP */
#define CMP3_IP_PB0 \
	GD32_PINMUX_AFIO('B', 0, GPIO_IN, NORMP)

/* CMP3_OUT */
#define CMP3_OUT_PB1 \
	GD32_PINMUX_AFIO('B', 1, ALTERNATE, NORMP)

/* CMP5_IM4 */
#define CMP5_IM4_PA4 \
	GD32_PINMUX_AFIO('A', 4, GPIO_IN, NORMP)

/* CMP5_IM5 */
#define CMP5_IM5_PA5 \
	GD32_PINMUX_AFIO('A', 5, GPIO_IN, NORMP)

/* CMP5_IM7 */
#define CMP5_IM7_PB15 \
	GD32_PINMUX_AFIO('B', 15, GPIO_IN, NORMP)

/* CMP5_IP */
#define CMP5_IP_PB11 \
	GD32_PINMUX_AFIO('B', 11, GPIO_IN, NORMP)

/* CMP5_OUT */
#define CMP5_OUT_PA10 \
	GD32_PINMUX_AFIO('A', 10, ALTERNATE, NORMP)
#define CMP5_OUT_PC6 \
	GD32_PINMUX_AFIO('C', 6, ALTERNATE, NORMP)

/* CTC_SYNC */
#define CTC_SYNC_PA8_NORMP \
	GD32_PINMUX_AFIO('A', 8, ALTERNATE, CTC_NORMP)

/* DAC0_OUT0 */
#define DAC0_OUT0_PA4 \
	GD32_PINMUX_AFIO('A', 4, ANALOG, NORMP)

/* DAC0_OUT1 */
#define DAC0_OUT1_PA5 \
	GD32_PINMUX_AFIO('A', 5, ANALOG, NORMP)

/* DAC1_OUT0 */
#define DAC1_OUT0_PA6 \
	GD32_PINMUX_AFIO('A', 6, ANALOG, NORMP)

/* ETH_MII_COL */
#define ETH_MII_COL_PA3 \
	GD32_PINMUX_AFIO('A', 3, GPIO_IN, NORMP)

/* ETH_MII_CRS */
#define ETH_MII_CRS_PA0 \
	GD32_PINMUX_AFIO('A', 0, GPIO_IN, NORMP)

/* ETH_MII_MDC */
#define ETH_MII_MDC_PC1 \
	GD32_PINMUX_AFIO('C', 1, ALTERNATE, NORMP)

/* ETH_MII_MDIO */
#define ETH_MII_MDIO_PA2 \
	GD32_PINMUX_AFIO('A', 2, ALTERNATE, NORMP)

/* ETH_MII_PPS_OUT */
#define ETH_MII_PPS_OUT_PB5 \
	GD32_PINMUX_AFIO('B', 5, ALTERNATE, NORMP)

/* ETH_MII_RXD0 */
#define ETH_MII_RXD0_PC4_NORMP \
	GD32_PINMUX_AFIO('C', 4, GPIO_IN, ETH_NORMP)

/* ETH_MII_RXD1 */
#define ETH_MII_RXD1_PC5_NORMP \
	GD32_PINMUX_AFIO('C', 5, GPIO_IN, ETH_NORMP)

/* ETH_MII_RXD2 */
#define ETH_MII_RXD2_PB0_NORMP \
	GD32_PINMUX_AFIO('B', 0, GPIO_IN, ETH_NORMP)

/* ETH_MII_RXD3 */
#define ETH_MII_RXD3_PB1_NORMP \
	GD32_PINMUX_AFIO('B', 1, GPIO_IN, ETH_NORMP)

/* ETH_MII_RX_CLK */
#define ETH_MII_RX_CLK_PA1 \
	GD32_PINMUX_AFIO('A', 1, GPIO_IN, NORMP)

/* ETH_MII_RX_DV */
#define ETH_MII_RX_DV_PA7_NORMP \
	GD32_PINMUX_AFIO('A', 7, GPIO_IN, ETH_NORMP)

/* ETH_MII_RX_ER */
#define ETH_MII_RX_ER_PB10 \
	GD32_PINMUX_AFIO('B', 10, GPIO_IN, NORMP)

/* ETH_MII_TXD0 */
#define ETH_MII_TXD0_PB12 \
	GD32_PINMUX_AFIO('B', 12, ALTERNATE, NORMP)

/* ETH_MII_TXD1 */
#define ETH_MII_TXD1_PB13 \
	GD32_PINMUX_AFIO('B', 13, ALTERNATE, NORMP)

/* ETH_MII_TXD2 */
#define ETH_MII_TXD2_PC2 \
	GD32_PINMUX_AFIO('C', 2, ALTERNATE, NORMP)

/* ETH_MII_TXD3 */
#define ETH_MII_TXD3_PB8 \
	GD32_PINMUX_AFIO('B', 8, ALTERNATE, NORMP)

/* ETH_MII_TX_CLK */
#define ETH_MII_TX_CLK_PC3 \
	GD32_PINMUX_AFIO('C', 3, GPIO_IN, NORMP)

/* ETH_MII_TX_EN */
#define ETH_MII_TX_EN_PB11 \
	GD32_PINMUX_AFIO('B', 11, ALTERNATE, NORMP)

/* ETH_RMII_CRS_DV */
#define ETH_RMII_CRS_DV_PA7_NORMP \
	GD32_PINMUX_AFIO('A', 7, GPIO_IN, ETH_NORMP)

/* ETH_RMII_MDC */
#define ETH_RMII_MDC_PC1 \
	GD32_PINMUX_AFIO('C', 1, ALTERNATE, NORMP)

/* ETH_RMII_MDIO */
#define ETH_RMII_MDIO_PA2 \
	GD32_PINMUX_AFIO('A', 2, ALTERNATE, NORMP)

/* ETH_RMII_PPS_OUT */
#define ETH_RMII_PPS_OUT_PB5 \
	GD32_PINMUX_AFIO('B', 5, ALTERNATE, NORMP)

/* ETH_RMII_REF_CLK */
#define ETH_RMII_REF_CLK_PA1 \
	GD32_PINMUX_AFIO('A', 1, GPIO_IN, NORMP)

/* ETH_RMII_RXD0 */
#define ETH_RMII_RXD0_PC4_NORMP \
	GD32_PINMUX_AFIO('C', 4, GPIO_IN, ETH_NORMP)

/* ETH_RMII_RXD1 */
#define ETH_RMII_RXD1_PC5_NORMP \
	GD32_PINMUX_AFIO('C', 5, GPIO_IN, ETH_NORMP)

/* ETH_RMII_TXD0 */
#define ETH_RMII_TXD0_PB12 \
	GD32_PINMUX_AFIO('B', 12, ALTERNATE, NORMP)

/* ETH_RMII_TXD1 */
#define ETH_RMII_TXD1_PB13 \
	GD32_PINMUX_AFIO('B', 13, ALTERNATE, NORMP)

/* ETH_RMII_TX_EN */
#define ETH_RMII_TX_EN_PB11 \
	GD32_PINMUX_AFIO('B', 11, ALTERNATE, NORMP)

/* EXMC_NADV */
#define EXMC_NADV_PB7 \
	GD32_PINMUX_AFIO('B', 7, ALTERNATE, NORMP)

/* I2C0_SCL */
#define I2C0_SCL_PB6_NORMP \
	GD32_PINMUX_AFIO('B', 6, ALTERNATE, I2C0_NORMP)
#define I2C0_SCL_PB8_NORMP \
	GD32_PINMUX_AFIO('B', 8, ALTERNATE, I2C0_NORMP)
#define I2C0_SCL_PB8_RMP \
	GD32_PINMUX_AFIO('B', 8, ALTERNATE, I2C0_RMP)

/* I2C0_SDA */
#define I2C0_SDA_PB7_NORMP \
	GD32_PINMUX_AFIO('B', 7, ALTERNATE, I2C0_NORMP)
#define I2C0_SDA_PB9_NORMP \
	GD32_PINMUX_AFIO('B', 9, ALTERNATE, I2C0_NORMP)
#define I2C0_SDA_PB9_RMP \
	GD32_PINMUX_AFIO('B', 9, ALTERNATE, I2C0_RMP)

/* I2C0_SMBA */
#define I2C0_SMBA_PB5 \
	GD32_PINMUX_AFIO('B', 5, ALTERNATE, NORMP)

/* I2C0_TXFRAME */
#define I2C0_TXFRAME_PB4 \
	GD32_PINMUX_AFIO('B', 4, ALTERNATE, NORMP)

/* I2C1_SCL */
#define I2C1_SCL_PB10 \
	GD32_PINMUX_AFIO('B', 10, ALTERNATE, NORMP)

/* I2C1_SDA */
#define I2C1_SDA_PB11 \
	GD32_PINMUX_AFIO('B', 11, ALTERNATE, NORMP)

/* I2C1_SMBA */
#define I2C1_SMBA_PB12 \
	GD32_PINMUX_AFIO('B', 12, ALTERNATE, NORMP)

/* I2C1_TXFRAME */
#define I2C1_TXFRAME_PB13 \
	GD32_PINMUX_AFIO('B', 13, ALTERNATE, NORMP)

/* I2C2_SCL */
#define I2C2_SCL_PA8 \
	GD32_PINMUX_AFIO('A', 8, ALTERNATE, NORMP)
#define I2C2_SCL_PB5 \
	GD32_PINMUX_AFIO('B', 5, ALTERNATE, NORMP)
#define I2C2_SCL_PC10 \
	GD32_PINMUX_AFIO('C', 10, ALTERNATE, NORMP)

/* I2C2_SDA */
#define I2C2_SDA_PB4 \
	GD32_PINMUX_AFIO('B', 4, ALTERNATE, NORMP)
#define I2C2_SDA_PB8 \
	GD32_PINMUX_AFIO('B', 8, ALTERNATE, NORMP)
#define I2C2_SDA_PC9 \
	GD32_PINMUX_AFIO('C', 9, ALTERNATE, NORMP)

/* I2C2_SMBA */
#define I2C2_SMBA_PA9 \
	GD32_PINMUX_AFIO('A', 9, ALTERNATE, NORMP)

/* I2S1_ADD_SD */
#define I2S1_ADD_SD_PB14_INP \
	GD32_PINMUX_AFIO('B', 14, GPIO_IN, NORMP)
#define I2S1_ADD_SD_PB14_OUT \
	GD32_PINMUX_AFIO('B', 14, ALTERNATE, NORMP)
#define I2S1_ADD_SD_PC2_INP \
	GD32_PINMUX_AFIO('C', 2, GPIO_IN, NORMP)
#define I2S1_ADD_SD_PC2_OUT \
	GD32_PINMUX_AFIO('C', 2, ALTERNATE, NORMP)

/* I2S1_CK */
#define I2S1_CK_PB13 \
	GD32_PINMUX_AFIO('B', 13, ALTERNATE, NORMP)

/* I2S1_MCK */
#define I2S1_MCK_PC6_INP \
	GD32_PINMUX_AFIO('C', 6, GPIO_IN, NORMP)
#define I2S1_MCK_PC6_OUT \
	GD32_PINMUX_AFIO('C', 6, ALTERNATE, NORMP)

/* I2S1_SD */
#define I2S1_SD_PB15_INP \
	GD32_PINMUX_AFIO('B', 15, GPIO_IN, NORMP)
#define I2S1_SD_PB15_OUT \
	GD32_PINMUX_AFIO('B', 15, ALTERNATE, NORMP)

/* I2S1_WS */
#define I2S1_WS_PB12_INP \
	GD32_PINMUX_AFIO('B', 12, GPIO_IN, NORMP)
#define I2S1_WS_PB12_OUT \
	GD32_PINMUX_AFIO('B', 12, ALTERNATE, NORMP)

/* I2S2_ADD_SD */
#define I2S2_ADD_SD_PB4_INP \
	GD32_PINMUX_AFIO('B', 4, GPIO_IN, NORMP)
#define I2S2_ADD_SD_PB4_OUT \
	GD32_PINMUX_AFIO('B', 4, ALTERNATE, NORMP)
#define I2S2_ADD_SD_PC11_INP \
	GD32_PINMUX_AFIO('C', 11, GPIO_IN, NORMP)
#define I2S2_ADD_SD_PC11_OUT \
	GD32_PINMUX_AFIO('C', 11, ALTERNATE, NORMP)

/* I2S2_CK */
#define I2S2_CK_PB3_NORMP \
	GD32_PINMUX_AFIO('B', 3, ALTERNATE, I2S2_NORMP)
#define I2S2_CK_PC10_NORMP \
	GD32_PINMUX_AFIO('C', 10, ALTERNATE, I2S2_NORMP)
#define I2S2_CK_PC10_RMP \
	GD32_PINMUX_AFIO('C', 10, ALTERNATE, I2S2_RMP)

/* I2S2_MCK */
#define I2S2_MCK_PC7_INP \
	GD32_PINMUX_AFIO('C', 7, GPIO_IN, NORMP)
#define I2S2_MCK_PC7_OUT \
	GD32_PINMUX_AFIO('C', 7, ALTERNATE, NORMP)

/* I2S2_SD */
#define I2S2_SD_PB5_INP_NORMP \
	GD32_PINMUX_AFIO('B', 5, GPIO_IN, I2S2_NORMP)
#define I2S2_SD_PB5_OUT_NORMP \
	GD32_PINMUX_AFIO('B', 5, ALTERNATE, I2S2_NORMP)
#define I2S2_SD_PC12_INP_NORMP \
	GD32_PINMUX_AFIO('C', 12, GPIO_IN, I2S2_NORMP)
#define I2S2_SD_PC12_OUT_NORMP \
	GD32_PINMUX_AFIO('C', 12, ALTERNATE, I2S2_NORMP)
#define I2S2_SD_PC12_INP_RMP \
	GD32_PINMUX_AFIO('C', 12, GPIO_IN, I2S2_RMP)
#define I2S2_SD_PC12_OUT_RMP \
	GD32_PINMUX_AFIO('C', 12, ALTERNATE, I2S2_RMP)

