GD32-MCU-IOT/hal_gigadevice_zephyr/include/dt-bindings/pinctrl/gd32e517r(c-e)xx-pinctrl.h
/* I2S2_WS */
#define I2S2_WS_PA4_INP_NORMP \
	GD32_PINMUX_AFIO('A', 4, GPIO_IN, I2S2_NORMP)
#define I2S2_WS_PA4_OUT_NORMP \
	GD32_PINMUX_AFIO('A', 4, ALTERNATE, I2S2_NORMP)
#define I2S2_WS_PA4_INP_RMP \
	GD32_PINMUX_AFIO('A', 4, GPIO_IN, I2S2_RMP)
#define I2S2_WS_PA4_OUT_RMP \
	GD32_PINMUX_AFIO('A', 4, ALTERNATE, I2S2_RMP)
#define I2S2_WS_PA15_INP_NORMP \
	GD32_PINMUX_AFIO('A', 15, GPIO_IN, I2S2_NORMP)
#define I2S2_WS_PA15_OUT_NORMP \
	GD32_PINMUX_AFIO('A', 15, ALTERNATE, I2S2_NORMP)

/* OSC32IN */
#define OSC32IN_PC14 \
	GD32_PINMUX_AFIO('C', 14, GPIO_IN, NORMP)

/* OSC32OUT */
#define OSC32OUT_PC15 \
	GD32_PINMUX_AFIO('C', 15, ALTERNATE, NORMP)

/* SDIO_CK */
#define SDIO_CK_PC12 \
	GD32_PINMUX_AFIO('C', 12, ALTERNATE, NORMP)

/* SDIO_CMD */
#define SDIO_CMD_PD2 \
	GD32_PINMUX_AFIO('D', 2, ALTERNATE, NORMP)

/* SDIO_D0 */
#define SDIO_D0_PC8 \
	GD32_PINMUX_AFIO('C', 8, ALTERNATE, NORMP)

/* SDIO_D1 */
#define SDIO_D1_PC9 \
	GD32_PINMUX_AFIO('C', 9, ALTERNATE, NORMP)

/* SDIO_D2 */
#define SDIO_D2_PC10 \
	GD32_PINMUX_AFIO('C', 10, ALTERNATE, NORMP)

/* SDIO_D3 */
#define SDIO_D3_PC11 \
	GD32_PINMUX_AFIO('C', 11, ALTERNATE, NORMP)

/* SDIO_D4 */
#define SDIO_D4_PB8 \
	GD32_PINMUX_AFIO('B', 8, ALTERNATE, NORMP)

/* SDIO_D5 */
#define SDIO_D5_PB9 \
	GD32_PINMUX_AFIO('B', 9, ALTERNATE, NORMP)

/* SDIO_D6 */
#define SDIO_D6_PC6 \
	GD32_PINMUX_AFIO('C', 6, ALTERNATE, NORMP)

/* SDIO_D7 */
#define SDIO_D7_PC7 \
	GD32_PINMUX_AFIO('C', 7, ALTERNATE, NORMP)

/* SHRTIMER_EXEV0 */
#define SHRTIMER_EXEV0_PC12 \
	GD32_PINMUX_AFIO('C', 12, GPIO_IN, NORMP)

/* SHRTIMER_EXEV1 */
#define SHRTIMER_EXEV1_PC11 \
	GD32_PINMUX_AFIO('C', 11, GPIO_IN, NORMP)

/* SHRTIMER_EXEV2 */
#define SHRTIMER_EXEV2_PB7 \
	GD32_PINMUX_AFIO('B', 7, GPIO_IN, NORMP)

/* SHRTIMER_EXEV3 */
#define SHRTIMER_EXEV3_PB6 \
	GD32_PINMUX_AFIO('B', 6, GPIO_IN, NORMP)

/* SHRTIMER_EXEV4 */
#define SHRTIMER_EXEV4_PB9 \
	GD32_PINMUX_AFIO('B', 9, GPIO_IN, NORMP)

/* SHRTIMER_EXEV5 */
#define SHRTIMER_EXEV5_PB5 \
	GD32_PINMUX_AFIO('B', 5, GPIO_IN, NORMP)

/* SHRTIMER_EXEV6 */
#define SHRTIMER_EXEV6_PB4 \
	GD32_PINMUX_AFIO('B', 4, GPIO_IN, NORMP)

/* SHRTIMER_EXEV7 */
#define SHRTIMER_EXEV7_PB8 \
	GD32_PINMUX_AFIO('B', 8, GPIO_IN, NORMP)

/* SHRTIMER_EXEV8 */
#define SHRTIMER_EXEV8_PB3 \
	GD32_PINMUX_AFIO('B', 3, GPIO_IN, NORMP)

/* SHRTIMER_EXEV9 */
#define SHRTIMER_EXEV9_PC6 \
	GD32_PINMUX_AFIO('C', 6, GPIO_IN, NORMP)

/* SHRTIMER_FLT0 */
#define SHRTIMER_FLT0_PA12 \
	GD32_PINMUX_AFIO('A', 12, GPIO_IN, NORMP)

/* SHRTIMER_FLT1 */
#define SHRTIMER_FLT1_PA15 \
	GD32_PINMUX_AFIO('A', 15, GPIO_IN, NORMP)

/* SHRTIMER_FLT2 */
#define SHRTIMER_FLT2_PB10 \
	GD32_PINMUX_AFIO('B', 10, GPIO_IN, NORMP)

/* SHRTIMER_FLT3 */
#define SHRTIMER_FLT3_PB11 \
	GD32_PINMUX_AFIO('B', 11, GPIO_IN, NORMP)

/* SHRTIMER_FLT4 */
#define SHRTIMER_FLT4_PC7 \
	GD32_PINMUX_AFIO('C', 7, GPIO_IN, NORMP)

/* SHRTIMER_SCIN */
#define SHRTIMER_SCIN_PB2 \
	GD32_PINMUX_AFIO('B', 2, GPIO_IN, NORMP)
#define SHRTIMER_SCIN_PB6 \
	GD32_PINMUX_AFIO('B', 6, GPIO_IN, NORMP)

/* SHRTIMER_SCOUT */
#define SHRTIMER_SCOUT_PB1 \
	GD32_PINMUX_AFIO('B', 1, ALTERNATE, NORMP)
#define SHRTIMER_SCOUT_PB3 \
	GD32_PINMUX_AFIO('B', 3, ALTERNATE, NORMP)

/* SHRTIMER_ST0CH0 */
#define SHRTIMER_ST0CH0_PA8 \
	GD32_PINMUX_AFIO('A', 8, ALTERNATE, NORMP)

/* SHRTIMER_ST0CH1 */
#define SHRTIMER_ST0CH1_PA9 \
	GD32_PINMUX_AFIO('A', 9, ALTERNATE, NORMP)

/* SHRTIMER_ST1CH0 */
#define SHRTIMER_ST1CH0_PA10 \
	GD32_PINMUX_AFIO('A', 10, ALTERNATE, NORMP)

/* SHRTIMER_ST1CH1 */
#define SHRTIMER_ST1CH1_PA11 \
	GD32_PINMUX_AFIO('A', 11, ALTERNATE, NORMP)

/* SHRTIMER_ST2CH0 */
#define SHRTIMER_ST2CH0_PB12 \
	GD32_PINMUX_AFIO('B', 12, ALTERNATE, NORMP)

/* SHRTIMER_ST2CH1 */
#define SHRTIMER_ST2CH1_PB13 \
	GD32_PINMUX_AFIO('B', 13, ALTERNATE, NORMP)

/* SHRTIMER_ST3CH0 */
#define SHRTIMER_ST3CH0_PB14 \
	GD32_PINMUX_AFIO('B', 14, ALTERNATE, NORMP)

/* SHRTIMER_ST3CH1 */
#define SHRTIMER_ST3CH1_PB15 \
	GD32_PINMUX_AFIO('B', 15, ALTERNATE, NORMP)

/* SHRTIMER_ST4CH0 */
#define SHRTIMER_ST4CH0_PC8 \
	GD32_PINMUX_AFIO('C', 8, ALTERNATE, NORMP)

/* SHRTIMER_ST4CH1 */
#define SHRTIMER_ST4CH1_PC9 \
	GD32_PINMUX_AFIO('C', 9, ALTERNATE, NORMP)

/* SPI0_IO2 */
#define SPI0_IO2_PA2_NORMP \
	GD32_PINMUX_AFIO('A', 2, ALTERNATE, SPI0_NORMP)
#define SPI0_IO2_PB6_NORMP \
	GD32_PINMUX_AFIO('B', 6, ALTERNATE, SPI0_NORMP)
#define SPI0_IO2_PB6_RMP \
	GD32_PINMUX_AFIO('B', 6, ALTERNATE, SPI0_RMP)

/* SPI0_IO3 */
#define SPI0_IO3_PA3_NORMP \
	GD32_PINMUX_AFIO('A', 3, ALTERNATE, SPI0_NORMP)
#define SPI0_IO3_PB7_NORMP \
	GD32_PINMUX_AFIO('B', 7, ALTERNATE, SPI0_NORMP)
#define SPI0_IO3_PB7_RMP \
	GD32_PINMUX_AFIO('B', 7, ALTERNATE, SPI0_RMP)

/* SPI0_MISO */
#define SPI0_MISO_PA6_NORMP \
	GD32_PINMUX_AFIO('A', 6, GPIO_IN, SPI0_NORMP)
#define SPI0_MISO_PB4_NORMP \
	GD32_PINMUX_AFIO('B', 4, GPIO_IN, SPI0_NORMP)
#define SPI0_MISO_PB4_RMP \
	GD32_PINMUX_AFIO('B', 4, GPIO_IN, SPI0_RMP)

/* SPI0_MOSI */
#define SPI0_MOSI_PA7_NORMP \
	GD32_PINMUX_AFIO('A', 7, ALTERNATE, SPI0_NORMP)
#define SPI0_MOSI_PB5_NORMP \
	GD32_PINMUX_AFIO('B', 5, ALTERNATE, SPI0_NORMP)
#define SPI0_MOSI_PB5_RMP \
	GD32_PINMUX_AFIO('B', 5, ALTERNATE, SPI0_RMP)

/* SPI0_NSS */
#define SPI0_NSS_PA4_NORMP \
	GD32_PINMUX_AFIO('A', 4, ALTERNATE, SPI0_NORMP)
#define SPI0_NSS_PA15_NORMP \
	GD32_PINMUX_AFIO('A', 15, ALTERNATE, SPI0_NORMP)
#define SPI0_NSS_PA15_RMP \
	GD32_PINMUX_AFIO('A', 15, ALTERNATE, SPI0_RMP)

/* SPI0_SCK */
#define SPI0_SCK_PA5_NORMP \
	GD32_PINMUX_AFIO('A', 5, ALTERNATE, SPI0_NORMP)
#define SPI0_SCK_PB3_NORMP \
	GD32_PINMUX_AFIO('B', 3, ALTERNATE, SPI0_NORMP)
#define SPI0_SCK_PB3_RMP \
	GD32_PINMUX_AFIO('B', 3, ALTERNATE, SPI0_RMP)

/* SPI1_MISO */
#define SPI1_MISO_PB14 \
	GD32_PINMUX_AFIO('B', 14, GPIO_IN, NORMP)

/* SPI1_MOSI */
#define SPI1_MOSI_PB15 \
	GD32_PINMUX_AFIO('B', 15, ALTERNATE, NORMP)

/* SPI1_NSS */
#define SPI1_NSS_PB12 \
	GD32_PINMUX_AFIO('B', 12, ALTERNATE, NORMP)

/* SPI1_SCK */
#define SPI1_SCK_PB13 \
	GD32_PINMUX_AFIO('B', 13, ALTERNATE, NORMP)

/* SPI2_MISO */
#define SPI2_MISO_PB4_NORMP \
	GD32_PINMUX_AFIO('B', 4, GPIO_IN, SPI2_NORMP)
#define SPI2_MISO_PC11_NORMP \
	GD32_PINMUX_AFIO('C', 11, GPIO_IN, SPI2_NORMP)
#define SPI2_MISO_PC11_RMP \
	GD32_PINMUX_AFIO('C', 11, GPIO_IN, SPI2_RMP)

/* SPI2_MOSI */
#define SPI2_MOSI_PB5_NORMP \
	GD32_PINMUX_AFIO('B', 5, ALTERNATE, SPI2_NORMP)
#define SPI2_MOSI_PC12_NORMP \
	GD32_PINMUX_AFIO('C', 12, ALTERNATE, SPI2_NORMP)
#define SPI2_MOSI_PC12_RMP \
	GD32_PINMUX_AFIO('C', 12, ALTERNATE, SPI2_RMP)

/* SPI2_NSS */
#define SPI2_NSS_PA4_NORMP \
	GD32_PINMUX_AFIO('A', 4, ALTERNATE, SPI2_NORMP)
#define SPI2_NSS_PA4_RMP \
	GD32_PINMUX_AFIO('A', 4, ALTERNATE, SPI2_RMP)
#define SPI2_NSS_PA15_NORMP \
	GD32_PINMUX_AFIO('A', 15, ALTERNATE, SPI2_NORMP)

